# **Create a SQLite database called CourseData.db**

In [1]:
%load_ext sql
%sql sqlite:///CourseData.db

'Connected: @CourseData.db'

In [2]:
%%sql
--Dropping tables for when we need to restart and clear CourseData database-- 

DROP TABLE IF EXISTS SECTION;
DROP TABLE IF EXISTS COURSE;
DROP TABLE IF EXISTS INSTRUCTOR;
DROP TABLE IF EXISTS COURSE_MEETINGS;

 * sqlite:///CourseData.db
Done.
Done.
Done.
Done.

[]

In [3]:
%%sql
-- Creating table INSTRUCTOR with surrogate primary key-- 

CREATE TABLE 'INSTRUCTOR' (
    InID INTEGER NOT NULL PRIMARY KEY,
    Name TEXT NOT NULL
);

 * sqlite:///CourseData.db
Done.

[]

In [4]:
%%sql
--Creating table CATALOG with CatID as the primary key-- 

CREATE TABLE 'CATALOG'(
    CatID VARCHAR PRIMARY KEY,
    Title VARCHAR NOT NULL,
    Description TEXT NOT NULL,
    Credits TEXT NOT NULL,
    PName TEXT NOT NULL,
    PCode TEXT,
    PREREQS TEXT,
    COREQS TEXT,
    FEES INTEGER,
    Attribute TEXT
    
);

 * sqlite:///CourseData.db
(sqlite3.OperationalError) table 'CATALOG' already exists [SQL: "--Creating table CATALOG with CatID as the primary key-- \n\nCREATE TABLE 'CATALOG'(\n    CatID VARCHAR PRIMARY KEY,\n    Title VARCHAR NOT NULL,\n    Description TEXT NOT NULL,\n    Credits TEXT NOT NULL,\n    PName TEXT NOT NULL,\n    PCode TEXT,\n    PREREQS TEXT,\n    COREQS TEXT,\n    FEES INTEGER,\n    Attribute TEXT\n    \n);"] (Background on this error at: http://sqlalche.me/e/e3q8)

In [5]:
%%sql
--Creating table SECTION with surrogate primary key-- 

CREATE TABLE 'SECTION'(
    SID INTEGER NOT NULL PRIMARY KEY,
    CRN INTEGER NOT NULL,
    Term TEXT NOT NULL,
    Section VARCHAR NOT NULL,
    Cap INTEGER,
    Act INTEGER,
    Rem INTEGER,
    CatID VARCHAR,
    InID INTEGER,
    FOREIGN KEY (CatID) REFERENCES COURSE(CatID),
    FOREIGN KEY (InID) REFERENCES INSTRUCTOR(InID)
);

 * sqlite:///CourseData.db
Done.

[]

In [6]:
%%sql

--Creating table COURSE_MEETINGS with CatID as the Primary Key-- 

CREATE TABLE 'COURSE_MEETINGS' (
    MID INTEGER NOT NULL PRIMARY KEY,
    CRN INTEGER NOT NULL,
    Term TEXT NOT NULL,
    Start TEXT NOT NULL,
    Location VARCHAR NOT NULL,
    Day TEXT NOT NULL,
    End TEXT NOT NULL,
    FOREIGN KEY (CRN) REFERENCES SECTION(CRN),
    FOREIGN KEY (Term) REFERENCES SECTION(Term)
);

 * sqlite:///CourseData.db
Done.

[]

In [7]:
%%sql
SELECT AVG(Cap) AS Average_Capacity
FROM SECTION;

 * sqlite:///CourseData.db
Done.

[(None,)]

In [8]:
%%sql
SELECT COUNT(CatID) 
FROM Catalog
WHERE Credits = '4 Credits' 
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[(55,)]

In [9]:
%%sql
SELECT Count(CatID), PCode, PName
FROM Catalog
WHERE Credits = '4 Credits' 
GROUP BY PCode
LIMIT 25;

 * sqlite:///CourseData.db
Done.

[(1, 'BEN', 'Bioengineering'),
 (18, 'BI', 'Biology'),
 (1, 'ED', 'Education'),
 (2, 'HR', 'Honors'),
 (1, 'ID', 'Interdisciplinary'),
 (1, 'LA', 'Latin'),
 (1, 'LAC', 'Latin American and Caribbean Studies'),
 (6, 'MA', 'Mathematics'),
 (19, 'NS', 'Nursing'),
 (3, 'PY', 'Psychology'),
 (2, 'SO', 'Sociology')]

In [10]:
%%sql

--Populating Course_Meetings table using import_course_meetings data-- 

INSERT INTO Course_Meetings (CRN, Term, Start, Location, Day, End)
SELECT DISTINCT crn, term, start, location, day, end 
FROM import_course_meetings;

 * sqlite:///CourseData.db
Done.

[]

In [11]:
%%sql 

--Checking data population of Course_Meetings table-- 

SELECT * 
FROM Course_Meetings
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'Fall2014', '2014-09-02T08:00:00', 'DSB 105', 'T', '2014-09-02T09:15:00'),
 (2, 70384, 'Fall2014', '2014-09-05T08:00:00', 'DSB 105', 'F', '2014-09-05T09:15:00'),
 (3, 70384, 'Fall2014', '2014-09-09T08:00:00', 'DSB 105', 'T', '2014-09-09T09:15:00'),
 (4, 70384, 'Fall2014', '2014-09-12T08:00:00', 'DSB 105', 'F', '2014-09-12T09:15:00'),
 (5, 70384, 'Fall2014', '2014-09-16T08:00:00', 'DSB 105', 'T', '2014-09-16T09:15:00'),
 (6, 70384, 'Fall2014', '2014-09-19T08:00:00', 'DSB 105', 'F', '2014-09-19T09:15:00'),
 (7, 70384, 'Fall2014', '2014-09-23T08:00:00', 'DSB 105', 'T', '2014-09-23T09:15:00'),
 (8, 70384, 'Fall2014', '2014-09-26T08:00:00', 'DSB 105', 'F', '2014-09-26T09:15:00'),
 (9, 70384, 'Fall2014', '2014-09-30T08:00:00', 'DSB 105', 'T', '2014-09-30T09:15:00'),
 (10, 70384, 'Fall2014', '2014-10-03T08:00:00', 'DSB 105', 'F', '2014-10-03T09:15:00')]

In [12]:
%%sql 

--Populating Catalog table using import_catalogs data--  

INSERT INTO Catalog (CatID, Title, Description, Credits, PName, PCode, PREREQS, COREQS, FEES, Attribute)
SELECT DISTINCT catalog_id, course_title, description, credits, program_name, program_code, prereqs, coreqs, fees, attributes
FROM import_catalogs;

 * sqlite:///CourseData.db

IntegrityError: (sqlite3.IntegrityError) UNIQUE constraint failed: CATALOG.CatID [SQL: '--Populating Catalog table using import_catalogs data--  \n\nINSERT INTO Catalog (CatID, Title, Description, Credits, PName, PCode, PREREQS, COREQS, FEES, Attribute)\nSELECT DISTINCT catalog_id, course_title, description, credits, program_name, program_code, prereqs, coreqs, fees, attributes\nFROM import_catalogs;'] (Background on this error at: http://sqlalche.me/e/gkpj)

In [13]:
%%sql 

--Checking data population of Course table-- 

SELECT * 
FROM Catalog
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[('AN 0301', 'Independent Study', 'Students undertake an individualized program of study in consultation with a director from the Asian studies faculty.', '1-3 Credits', 'Asian Studies', 'AN', '', '', '', ''),
 ('AN 0310', 'Asian Studies Seminar', 'This seminar examines selected topics concerning Asia. This course is taught in conjunction with another 100-300 level course from a rotation of cour ... (412 characters truncated) ... e term paper in substitution of some portion of the conjoined course requirements, as determined by the instructor. Open to juniors and seniors only.', '3 Credits', 'Asian Studies', 'AN', '', '', '', ''),
 ('BU 0211', 'Legal Environment of Business', 'This course examines the broad philosophical as well as practical nature and function of the legal system, and introduces students to the legal and s ... (171 characters truncated) ... ivil process, and regulatory areas such as employment discrimination, protection of the environment, and corporate governance and securities markets.', '3 Credits', 'Business', 'BU', 'Junior standing.', '', '', ''),
 ('BU 0220', 'Environmental Law and Policy', 'This course surveys issues arising out of federal laws designed to protect the environment and manage resources. It considers in detail the role of t ... (298 characters truncated) ... t groups in shaping environmental policy, giving special attention to the impact of environmental regulation on business and private property rights.', '3 Credits', 'Business', 'BU', '', '', '', 'EVME Environmental Studies Major Elective, EVPE Environmental Studies Elective, EVSS Environmental Studies: Social Science, MGEL Management: General Elective'),
 ('BU 0311', 'The Law of Contracts, Sales, and Property', 'This course examines the components of common law contracts including the concepts of offer and acceptance, consideration, capacity and legality, ass ... (117 characters truncated) ...  the Uniform Commercial Code relating to leases, sales of goods, and warranties. The course also considers personal and real property, and bailments.', '3 Credits', 'Business', 'BU', 'BU 0211.', '', '', '')]

In [14]:
%%sql 

--Populating Instructor table using import_courses data--  

INSERT INTO Instructor (Name)
SELECT DISTINCT primary_instructor
FROM import_courses;

 * sqlite:///CourseData.db
Done.

[]

In [15]:
%%sql 

--Checking data population of Instructor table-- 

SELECT * 
FROM Instructor
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[(1, 'Michael P.  Coyne'),
 (2, 'Rebecca I.  Bloch'),
 (3, 'Paul   Caster'),
 (4, 'Jo Ann   Drusbosky'),
 (5, 'Arleen N.  Kardos')]

In [16]:
%%sql 

--Populating the SECTION table using import_courses data--
--Joining Instructor table using import_courses and instructor table--

INSERT INTO SECTION (CRN, Term, Section, Cap, Act, Rem, CatID, InID)
SELECT crn, term, section, cap, act, rem, catalog_id, InID
FROM import_courses
    JOIN Instructor ON (import_courses.primary_instructor = Instructor.Name)
;

 * sqlite:///CourseData.db
Done.

[]

In [17]:
%%sql 

--Checking data population of Section table--

SELECT * 
FROM Section
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 70384, 'Fall2014', 'C01', 0, 31, -31, 'AC 0011', 1),
 (2, 70385, 'Fall2014', 'C02', 0, 31, -31, 'AC 0011', 1),
 (3, 70382, 'Fall2014', 'C03', 0, 31, -31, 'AC 0011', 1),
 (4, 70291, 'Fall2014', 'C04', 0, 29, -29, 'AC 0011', 2),
 (5, 70350, 'Fall2014', 'C05', 0, 30, -30, 'AC 0011', 2),
 (6, 70381, 'Fall2014', 'C06', 0, 31, -31, 'AC 0011', 2),
 (7, 70383, 'Fall2014', 'G', 30, 31, -1, 'AC 0011', 3),
 (8, 70391, 'Fall2014', 'H', 30, 32, -2, 'AC 0011', 4),
 (9, 71105, 'Fall2014', 'I', 30, 33, -3, 'AC 0011', 4),
 (10, 71123, 'Fall2014', 'J', 30, 32, -2, 'AC 0011', 4)]

In [18]:
%%sql 

SELECT (SUM(strftime('%s',End)-strftime('%s',Start))/60)/60 AS CourseHours, CRN, Location, Term
FROM Course_Meetings
GROUP BY CRN
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(40, 10896, 'DMH 347', 'Winter2015'),
 (40, 10903, 'JGS 25', 'Winter2015'),
 (40, 10905, 'LYL 8', 'Winter2015'),
 (40, 10906, 'DMH 231', 'Winter2015'),
 (108, 10908, 'DSB 111', 'Winter2015'),
 (108, 10909, 'DSB 111', 'Winter2015'),
 (40, 10911, 'DSB 109', 'Winter2015'),
 (108, 10912, 'DSB 107', 'Winter2015'),
 (176, 10913, 'DSB 115', 'Winter2015'),
 (108, 11601, 'DSB 107', 'Winter2016')]

In [19]:
%%sql 

SELECT COUNT(CRN), Location, Term, (SUM(strftime('%s',End)-strftime('%s',Start))/60)/60 AS CourseHours
FROM Course_Meetings
GROUP BY Location, Term
ORDER BY CourseHours DESC
LIMIT 20;

 * sqlite:///CourseData.db
Done.

[(343, 'SON 203', 'Spring2017', 1142),
 (303, 'NHS 224', 'Spring2018', 1076),
 (156, 'YAL ', 'Spring2017', 994),
 (133, 'BY ARR ', 'Fall2015', 989),
 (134, 'YAL ', 'Spring2019', 938),
 (130, 'YAL ', 'Fall2016', 910),
 (129, 'VA ', 'Fall2017', 903),
 (268, 'NHS 224', 'Spring2019', 899),
 (141, 'YAL ', 'Fall2014', 890),
 (590, 'BNW 127', 'Fall2018', 862),
 (456, 'DSB 106', 'Fall2018', 843),
 (359, 'DSB 111', 'Spring2016', 837),
 (370, 'DSB 112', 'Fall2014', 833),
 (117, 'VA ', 'Fall2018', 819),
 (393, 'DSB 105', 'Spring2019', 816),
 (102, 'DSB 110', 'Spring2016', 816),
 (606, 'BNW 137', 'Fall2018', 803),
 (397, 'DSB 111', 'Spring2017', 796),
 (468, 'DSB 109', 'Spring2017', 792),
 (113, 'VA ', 'Spring2018', 791)]

# Querries

In [64]:
%%sql
/* Select PName, PCode, Title, Credits from Catalog where PName begins with A */
SELECT PName, PCode, Title, Credits
FROM Catalog
WHERE PName LIKE 'A%' 
GROUP BY PName

LIMIT 20;

 * sqlite:///CourseData.db
Done.

[('Accounting', 'AC', 'Introduction to Financial Accounting', '3 Credits'),
 ('American Studies', 'AS', 'Roots of American Culture', '3 Credits'),
 ('Anthropology', 'AY', 'Introduction to Four-Field Anthropology', '3 Credits'),
 ('Applied Ethics', 'AE', 'Ethics and the Community', '3 Credits'),
 ('Arabic', 'AR', 'Elementary Modern Standard Arabic I', '3 Credits'),
 ('Art History', 'AH', 'Origins and Transformations in Western Art', '3 Credits'),
 ('Asian Studies', 'AN', 'Independent Study', '1-3 Credits')]

In [98]:
%%sql
/* Using SELECT DISTINCT to look for duplicate a data records  */
SELECT COUNT(*)
    FROM Catalog;

 * sqlite:///CourseData.db
Done.

[(2221,)]

In [90]:
%%sql
/* Using SELECT DISTINCT to look for duplicate a data records  */

SELECT DISTINCT COUNT(*)
    FROM Catalog;

 * sqlite:///CourseData.db
Done.

[(2221,)]

In [91]:
%%sql
/* Using SELECT DISTINCT to look for duplicate a data records  */
SELECT COUNT(*)
    FROM Instructor;

 * sqlite:///CourseData.db
Done.

[(1105,)]

In [92]:
%%sql
/* Using SELECT DISTINCT to look for duplicate a data records  */
SELECT DISTINCT COUNT(*)
    FROM Instructor;

 * sqlite:///CourseData.db
Done.

[(1105,)]

In [93]:
%%sql
/* Using SELECT DISTINCT to look for duplicate a data records  */
SELECT COUNT(*)
    FROM Section;

 * sqlite:///CourseData.db
Done.

[(17435,)]

In [94]:
%%sql
/* Using SELECT DISTINCT to look for duplicate a data records  */
SELECT DISTINCT COUNT(*)
    FROM Section;

 * sqlite:///CourseData.db
Done.

[(17435,)]

In [95]:
%%sql
/* Using SELECT DISTINCT to look for duplicate a data records  */
SELECT COUNT(*)
    FROM Course_Meetings;

 * sqlite:///CourseData.db
Done.

[(311142,)]

In [96]:
%%sql
/* Using SELECT DISTINCT to look for duplicate a data records  */
SELECT DISTINCT COUNT(*)
    FROM Course_Meetings;

 * sqlite:///CourseData.db
Done.

[(311142,)]

In [68]:
%%sql
/* PName, Title, Name, Term, CRN From Section GROUP BY PName */
SELECT PName, Title, Name, Term, CRN
FROM Section

    JOIN Instructor USING (InID)
    JOIN Catalog USING (CatID)
GROUP BY PName


LIMIT 20;

 * sqlite:///CourseData.db
Done.

[('Accounting', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'Fall2014', 70384),
 ('American Studies', 'Roots of American Culture', 'Anna M.  Lawrence', 'Fall2014', 73082),
 ('Anthropology', 'Introduction to Four-Field Anthropology', 'Scott M.  Lacy', 'Fall2014', 71173),
 ('Applied Ethics', 'Ethics and the Community', 'Robert A.  Liftig', 'Fall2014', 70655),
 ('Arabic', 'Elementary Modern Standard Arabic I', 'Abdel Illah A.  Douda', 'Fall2014', 70670),
 ('Art History', 'Origins and Transformations in Western Art', 'Katherine A.  Schwab', 'Fall2014', 70255),
 ('Asian Studies', 'Independent Study', 'TBA', 'Fall2014', 71858),
 ('Bioengineering', 'Biomechanics', 'Susan L.  Freudzon', 'Fall2017', 72919),
 ('Biology', 'Fundamentals of Biology I', 'Bethann   Balazsi', 'Fall2014', 72386),
 ('Black Studies', 'Independent Study', 'Gwendoline M.  Alphonso', 'Fall2015', 77125),
 ('Business', 'Legal Environment of Business', 'Jennifer M. F.  Hillgen-Santa', 'Fall2014', 71162),
 ('Chemistry', 'Chemistry: Sights and Insights', "Edmond J.  O'Connell", 'Fall2014', 72614),
 ('Chinese', 'Elementary Chinese I', 'Jiwei   Xiao', 'Fall2014', 70674),
 ('Classical Studies', 'Masterpieces of Roman Literature in English Translation', 'Vincent J.  Rosivach', 'Fall2014', 72929),
 ('Communication', 'Human Communication Theories', 'Niall P.  Brennan', 'Fall2014', 70223),
 ('Computer Engineering', 'Digital Electronics Design II', 'James P.  Cavallo', 'Fall2014', 73074),
 ('Computer Science', 'Data Structures', 'Peter   Spoerri', 'Fall2014', 72202),
 ('Counseling', 'Comprehensive Exam in Clinical Mental Health Counseling', "JoAnn M.  O'Connell", 'Fall2014', 70616),
 ('Economics', 'Introduction to Microeconomics', 'Mark S.  Leclair', 'Fall2014', 70215),
 ('Education', 'Explorations in Education: Introduction to Teaching, Learning, and Schooling', 'Stephanie L.  Storms', 'Fall2014', 71070)]